# Rebar Bend Data Termination Orientation 0 Property

Source: https://www.revitapidocs.com/2026/fb7ea0ca-d147-b43c-5fb3-f620a05d4994.htm

---

| Rebar Bend Data Termination Orientation 0 Property |
| --- |

Identifies he orientation of the termination (e.g. hook, crank) at the start.
 The default value is RebarTerminationOrientation::Left.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarTerminationOrientation TerminationOrientation0 { get; set; }
```

```
Public Property TerminationOrientation0 As RebarTerminationOrientation
	Get
	Set
```

```
public:
property RebarTerminationOrientation TerminationOrientation0 {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
```

```
member TerminationOrientation0 : RebarTerminationOrientation with get, set
```

#### Property Value

RebarTerminationOrientation Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace